seqscan_benchmarking/patched.txt
columns 5 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 9.169 ms
initial connection time = 0.814 ms
tps = 109.057319 (without initial connection time)

columns 5 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 16.149 ms
initial connection time = 0.796 ms
tps = 61.922035 (without initial connection time)

columns 5 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 22.945 ms
initial connection time = 0.885 ms
tps = 43.581644 (without initial connection time)

columns 5 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 26.977 ms
initial connection time = 0.815 ms
tps = 37.068009 (without initial connection time)

columns 5 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 37.421 ms
initial connection time = 1.565 ms
tps = 26.723106 (without initial connection time)

columns 5 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 44.331 ms
initial connection time = 1.003 ms
tps = 22.557716 (without initial connection time)

columns 5 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 51.360 ms
initial connection time = 1.137 ms
tps = 19.470416 (without initial connection time)

columns 5 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 58.863 ms
initial connection time = 1.312 ms
tps = 16.988736 (without initial connection time)

columns 5 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 65.130 ms
initial connection time = 2.022 ms
tps = 15.353851 (without initial connection time)

columns 5 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 71.966 ms
initial connection time = 1.732 ms
tps = 13.895530 (without initial connection time)

columns 10 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 9.702 ms
initial connection time = 0.723 ms
tps = 103.068770 (without initial connection time)

columns 10 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 17.016 ms
initial connection time = 0.859 ms
tps = 58.766526 (without initial connection time)

columns 10 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 24.079 ms
initial connection time = 0.780 ms
tps = 41.529119 (without initial connection time)

columns 10 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 32.503 ms
initial connection time = 1.023 ms
tps = 30.766135 (without initial connection time)

columns 10 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 38.350 ms
initial connection time = 0.959 ms
tps = 26.075341 (without initial connection time)

columns 10 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 45.898 ms
initial connection time = 1.677 ms
tps = 21.787427 (without initial connection time)

columns 10 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 53.933 ms
initial connection time = 1.250 ms
tps = 18.541586 (without initial connection time)

columns 10 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 61.995 ms
initial connection time = 1.260 ms
tps = 16.130422 (without initial connection time)

columns 10 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 68.386 ms
initial connection time = 3.388 ms
tps = 14.622812 (without initial connection time)

columns 10 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 75.482 ms
initial connection time = 1.465 ms
tps = 13.248199 (without initial connection time)

columns 15 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 9.815 ms
initial connection time = 0.844 ms
tps = 101.888711 (without initial connection time)

columns 15 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 17.687 ms
initial connection time = 0.794 ms
tps = 56.537550 (without initial connection time)

columns 15 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 25.730 ms
initial connection time = 0.851 ms
tps = 38.865455 (without initial connection time)

columns 15 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 34.077 ms
initial connection time = 0.795 ms
tps = 29.345530 (without initial connection time)

columns 15 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 41.103 ms
initial connection time = 0.839 ms
tps = 24.329391 (without initial connection time)

columns 15 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 48.792 ms
initial connection time = 1.175 ms
tps = 20.495201 (without initial connection time)

columns 15 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 56.703 ms
initial connection time = 1.109 ms
tps = 17.635829 (without initial connection time)

columns 15 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 66.911 ms
initial connection time = 1.902 ms
tps = 14.945174 (without initial connection time)

columns 15 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 73.082 ms
initial connection time = 4.983 ms
tps = 13.683312 (without initial connection time)

columns 15 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 82.417 ms
initial connection time = 4.020 ms
tps = 12.133425 (without initial connection time)

columns 20 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 10.238 ms
initial connection time = 0.777 ms
tps = 97.675518 (without initial connection time)

columns 20 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 18.386 ms
initial connection time = 0.867 ms
tps = 54.388973 (without initial connection time)

columns 20 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 27.045 ms
initial connection time = 0.907 ms
tps = 36.975822 (without initial connection time)

columns 20 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 34.601 ms
initial connection time = 0.948 ms
tps = 28.900840 (without initial connection time)

columns 20 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 39.590 ms
initial connection time = 1.020 ms
tps = 25.259012 (without initial connection time)

columns 20 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 51.037 ms
initial connection time = 1.865 ms
tps = 19.593463 (without initial connection time)

columns 20 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 59.607 ms
initial connection time = 1.485 ms
tps = 16.776426 (without initial connection time)

columns 20 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 69.254 ms
initial connection time = 1.761 ms
tps = 14.439662 (without initial connection time)

columns 20 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 77.357 ms
initial connection time = 2.077 ms
tps = 12.927103 (without initial connection time)

columns 20 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 87.524 ms
initial connection time = 8.203 ms
tps = 11.425381 (without initial connection time)

columns 25 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 11.933 ms
initial connection time = 0.838 ms
tps = 83.803471 (without initial connection time)

columns 25 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 21.344 ms
initial connection time = 0.922 ms
tps = 46.852123 (without initial connection time)

columns 25 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 27.492 ms
initial connection time = 1.075 ms
tps = 36.374416 (without initial connection time)

columns 25 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 38.524 ms
initial connection time = 1.165 ms
tps = 25.958121 (without initial connection time)

columns 25 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 46.436 ms
initial connection time = 1.251 ms
tps = 21.535090 (without initial connection time)

columns 25 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 58.006 ms
initial connection time = 1.548 ms
tps = 17.239575 (without initial connection time)

columns 25 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 65.710 ms
initial connection time = 1.883 ms
tps = 15.218298 (without initial connection time)

columns 25 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 75.941 ms
initial connection time = 2.740 ms
tps = 13.168156 (without initial connection time)

columns 25 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 88.124 ms
initial connection time = 1.884 ms
tps = 11.347698 (without initial connection time)

columns 25 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 98.010 ms
initial connection time = 1.894 ms
tps = 10.203036 (without initial connection time)

columns 30 rows 1M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 11.504 ms
initial connection time = 1.028 ms
tps = 86.929460 (without initial connection time)

columns 30 rows 2M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 19.748 ms
initial connection time = 1.157 ms
tps = 50.638809 (without initial connection time)

columns 30 rows 3M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 28.935 ms
initial connection time = 3.067 ms
tps = 34.560556 (without initial connection time)

columns 30 rows 4M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 38.461 ms
initial connection time = 1.305 ms
tps = 26.000303 (without initial connection time)

columns 30 rows 5M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 47.090 ms
initial connection time = 1.496 ms
tps = 21.235922 (without initial connection time)

columns 30 rows 6M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 56.677 ms
initial connection time = 1.730 ms
tps = 17.643901 (without initial connection time)

columns 30 rows 7M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 67.567 ms
initial connection time = 1.734 ms
tps = 14.800083 (without initial connection time)

columns 30 rows 8M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 73.519 ms
initial connection time = 2.106 ms
tps = 13.601854 (without initial connection time)

columns 30 rows 9M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 87.159 ms
initial connection time = 1.971 ms
tps = 11.473342 (without initial connection time)

columns 30 rows 10M
pgbench (18devel)
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 98.593 ms
initial connection time = 2.525 ms
tps = 10.142686 (without initial connection time)